Revit 2024 API
IndexTriangle.Index1 Property
 The index of the triangle's second vertex.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public int Index1 { get; set; }
Visual Basic
Public Property Index1 As Integer
	Get
	Set
Visual C++
public:
property int Index1 {
	int get ();
	void set (int value);
}
See Also
IndexTriangle Class
Autodesk.Revit.DB.DirectContext3D Namespace